Revit 2016 API
FabricationPart.GetDimensionValue Method
 Gets the value of the fabrication dimension, returns value in Revit internal units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Syntax
C#
public double GetDimensionValue(
	FabricationDimensionDefinition dim
)
Visual Basic
Public Function GetDimensionValue ( _
	dim As FabricationDimensionDefinition _
) As Double
Visual C++
public:
double GetDimensionValue(
	FabricationDimensionDefinition^ dim
)
Parameters
dim
Type: Autodesk.Revit.DB.FabricationDimensionDefinition
 The fabrfication dimension.
Return Value
 The dimension value.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace